// // Напишите программу, которая на вход принимает число и выдаёт его 
// // квадрат (число умноженное на само себя).

// Console.Write("Insert a number: ");

// int number = Convert.ToInt32(Console.ReadLine());
// int sqrt = Convert.ToInt32(Math.Pow(number, 2));

// Console.WriteLine("Square of your number is: " + sqrt);


//2. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго
